#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/2132efef-e84d-44dd-b86b-43d935f59403/resourceGroups/rg-vnet]
module.virtual-network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/2132efef-e84d-44dd-b86b-43d935f59403/resourceGroups/rg-vnet/providers/Microsoft.Network/virtualNetworks/vnet-two-tier-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.subnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-two-tier-app"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-vnet"
      + virtual_network_name                           = "vnet-two-tier-app"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nikkbh, Action: `pull_request`*